piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/inc/MDR32VF0xI_bkp.h
/**
 ******************************************************************************
 * @file    MDR32VF0xI_bkp.h
 * @author  Milandr Application Team
 * @version V0.2.0
 * @date    23/05/2025
 * @brief   This file contains all the functions prototypes for the BKP
 *          firmware library.
 ******************************************************************************
 * <br><br>
 *
 * THE PRESENT FIRMWARE IS FOR GUIDANCE ONLY. IT AIMS AT PROVIDING CUSTOMERS
 * WITH CODING INFORMATION REGARDING MILANDR'S PRODUCTS IN ORDER TO FACILITATE
 * THE USE AND SAVE TIME. MILANDR SHALL NOT BE HELD LIABLE FOR ANY
 * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES RESULTING
 * FROM THE CONTENT OF SUCH FIRMWARE AND/OR A USE MADE BY CUSTOMERS OF THE
 * CODING INFORMATION CONTAINED HEREIN IN THEIR PRODUCTS.
 *
 * <h2><center>&copy; COPYRIGHT 2025 Milandr</center></h2>
 ******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef MDR32VF0xI_BKP_H
#define MDR32VF0xI_BKP_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "MDR32VF0xI_config.h"

/** @addtogroup MDR32VF0xI_StdPeriph_Driver MDR32VF0xI Standard Peripheral Driver
 * @{
 */

/** @addtogroup BKP BKP
 * @{
 */

/** @defgroup BKP_Exported_Types BKP Exported Types
 * @{
 */

/**
 * @brief BKP subblocks.
 */
typedef enum {
    BKP_MEM     = ((uint32_t)0x1 << 0), /*!< BKP MEM subblock: RAM of cryptographic keys (512 bytes). */
    BKP_CONTROL = ((uint32_t)0x1 << 1), /*!< BKP CONTROL subblock: JTAG and voltage regulators. */
    BKP_SW      = ((uint32_t)0x1 << 2), /*!< BKP SW subblock: emergency power supply control. */
    BKP_CLK     = ((uint32_t)0x1 << 3), /*!< BKP CLK subblock: clock source control. */
    BKP_RTC     = ((uint32_t)0x1 << 4), /*!< BKP RTC subblock: RTC, WUT, TAMPER, TIMESTAMP and TMPCAL (TMPCAL only for MDR1206FI and MDR1206AFI). */
    BKP_ALL     = ((uint32_t)0x1F)      /*!< Select all subblocks. */
} BKP_Subblocks_TypeDef;

#define IS_BKP_SUBBLOCK(SUBBLOCK) (((SUBBLOCK) & ~(uint32_t)(BKP_ALL)) == 0x0)

/**
 * @brief BKP BLDO boost/trim.
 */
typedef enum {
    BKP_BLDO_BOOST_TYPICAL   = (((uint32_t)0x0) << BKP_LDO_BLDO_TRIM_Pos),                      /*!< Typical battery power regulator voltage. */
    BKP_BLDO_BOOST_PLUS_2pct = (((uint32_t)0x1) << BKP_LDO_BLDO_TRIM_Pos) | BKP_LDO_BLDO_BOOST, /*!< Trim battery power regulator with + 2% from typical voltage. */
    BKP_BLDO_BOOST_PLUS_4pct = (((uint32_t)0x2) << BKP_LDO_BLDO_TRIM_Pos) | BKP_LDO_BLDO_BOOST, /*!< Trim battery power regulator with + 4% from typical voltage. */
    BKP_BLDO_BOOST_PLUS_6pct = (((uint32_t)0x3) << BKP_LDO_BLDO_TRIM_Pos) | BKP_LDO_BLDO_BOOST  /*!< Trim battery power regulator with + 6% from typical voltage. */
} BKP_BLDO_Boost_TypeDef;

#define IS_BKP_BLDO_BOOST(BOOST) (((BOOST) == BKP_BLDO_BOOST_TYPICAL) ||   \
                                  ((BOOST) == BKP_BLDO_BOOST_PLUS_2pct) || \
                                  ((BOOST) == BKP_BLDO_BOOST_PLUS_4pct) || \
                                  ((BOOST) == BKP_BLDO_BOOST_PLUS_6pct))

/**
 * @brief BKP WAKEUPx lines.
 */
typedef enum {
    BKP_WAKEUP_1 = BKP_LDO_WAKEUP1, /*!< Specify the WAKEUP1 input. */
    BKP_WAKEUP_2 = BKP_LDO_WAKEUP2, /*!< Specify the WAKEUP2 input. */
    BKP_WAKEUP_3 = BKP_LDO_WAKEUP3  /*!< Specify the WAKEUP3 input. */
} BKP_WAKEUP_TypeDef;

#define IS_BKP_WAKEUP(WAKEUP) (((WAKEUP) == BKP_WAKEUP_1) || \
                               ((WAKEUP) == BKP_WAKEUP_2) || \
                               ((WAKEUP) == BKP_WAKEUP_3))

/**
 * @brief BKP LSE (Low Speed External) oscillator clock mode and source selection constants.
 */
typedef enum {
    BKP_LSE_OFF    = ((uint32_t)0x0),                 /*!< Switch off LSE oscillator clock. */
    BKP_LSE_ON     = BKP_CLK_LSE_ON,                  /*!< Switch on LSE oscillator clock with the internal clock source. */
    BKP_LSE_BYPASS = BKP_CLK_LSE_ON | BKP_CLK_LSE_BYP /*!< Switch on LSE oscillator clock with an external clock source. */
} BKP_LSE_Mode_TypeDef;

#define IS_BKP_LSE_MODE(MODE) (((MODE) == BKP_LSE_OFF) || \
                               ((MODE) == BKP_LSE_ON) ||  \
                               ((MODE) == BKP_LSE_BYPASS))

/**
 * @brief BKP clock sources ready flags.
 */
typedef enum {
    BKP_FLAG_HSIRDY = BKP_CLK_HSI_RDY, /*!< Flag for entering the operating mode of the HSI oscillator clock. */
    BKP_FLAG_LSIRDY = BKP_CLK_LSI_RDY, /*!< Flag for entering the operating mode of the LSI oscillator clock. */
    BKP_FLAG_LSERDY = BKP_CLK_LSE_RDY  /*!< Flag for entering the operating mode of the LSE oscillator clock. */
} BKP_CLK_Flags_TypeDef;

#define IS_BKP_CLK_FLAG(FLAG) (((FLAG) == BKP_FLAG_HSIRDY) || \
                               ((FLAG) == BKP_FLAG_LSIRDY) || \
                               ((FLAG) == BKP_FLAG_LSERDY))

#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
/**
 * @brief BKP SW polarity configuration.
 */
typedef enum {
    BKP_SW_POLARITY_NON_INV = (((uint32_t)0x0) << BKP_RTC_TMPCAL3_SWCTR_INV_Pos), /*!< BKP SW output is not inverted. */
    BKP_SW_POLARITY_INV     = (((uint32_t)0x1) << BKP_RTC_TMPCAL3_SWCTR_INV_Pos)  /*!< BKP SW output is inverted. */
} BKP_SW_Polarity_TypeDef;

#define IS_BKP_SW_POLARITY(POL) (((POL) == BKP_SW_POLARITY_NON_INV) || \
                                 ((POL) == BKP_SW_POLARITY_INV))
#endif

/**
 * @brief BKP RTC WUT clock source.
 */
typedef enum {
    BKP_RTC_WUT_CLK_SRC_SEC_CLK        = BKP_RTC_CR_WUCK_SEL_SEC_CLK,       /*!< WUT clock is the same as for RTC/Calendar (SEC_CLK). */
    BKP_RTC_WUT_CLK_SRC_RTC_CLK_DIV_2  = BKP_RTC_CR_WUCK_SEL_RTC_CLK_DIV_2, /*!< WUT clock is the RTC_CLK divided by 2. */
    BKP_RTC_WUT_CLK_SRC_RTC_CLK_DIV_4  = BKP_RTC_CR_WUCK_SEL_RTC_CLK_DIV_4, /*!< WUT clock is the RTC_CLK divided by 4. */
    BKP_RTC_WUT_CLK_SRC_RTC_CLK_DIV_8  = BKP_RTC_CR_WUCK_SEL_RTC_CLK_DIV_8, /*!< WUT clock is the RTC_CLK divided by 8. */
    BKP_RTC_WUT_CLK_SRC_RTC_CLK_DIV_16 = BKP_RTC_CR_WUCK_SEL_RTC_CLK_DIV_16 /*!< WUT clock is the RTC_CLK divided by 16. */
} BKP_RTC_WUT_ClockSource_TypeDef;

#define IS_BKP_RTC_WUT_CLOCK_SOURCE(CLK) (((CLK) == BKP_RTC_WUT_CLK_SRC_SEC_CLK) ||       \
                                          ((CLK) == BKP_RTC_WUT_CLK_SRC_RTC_CLK_DIV_2) || \
                                          ((CLK) == BKP_RTC_WUT_CLK_SRC_RTC_CLK_DIV_4) || \
                                          ((CLK) == BKP_RTC_WUT_CLK_SRC_RTC_CLK_DIV_8) || \
                                          ((CLK) == BKP_RTC_WUT_CLK_SRC_RTC_CLK_DIV_16))

#if defined(USE_MDR32F02_REV_2) || defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
/**
 * @brief BKP RTC WUT SW control.
 */
typedef enum {
    BKP_RTC_WUT_SW_CONTROL_SW_PWR_LOW  = (((uint32_t)0x0) << BKP_RTC_TAFCR_WAKE_SLEEP_Pos), /*!< SW_PWR = 0 (switch is open) when WUTF is asserted. */
    BKP_RTC_WUT_SW_CONTROL_SW_PWR_HIGH = (((uint32_t)0x1) << BKP_RTC_TAFCR_WAKE_SLEEP_Pos)  /*!< SW_PWR = 1 (switch is closed) when WUTF is asserted. */
} BKP_RTC_WUT_SWControl_TypeDef;

