piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/inc/MDR32VF0xI_bkp.h
#define IS_BKP_RTC_WUT_SW_CONTROL(SW) (((SW) == BKP_RTC_WUT_SW_CONTROL_SW_PWR_LOW) || \
                                       ((SW) == BKP_RTC_WUT_SW_CONTROL_SW_PWR_HIGH))
#endif

/**
 * @brief BKP RTC clock source.
 */
typedef enum {
    BKP_RTC_CLK_SRC_LSI     = BKP_RTC_CR_RTC_SEL_LSI,     /*!< The LSI oscillator clock is selected as the RTC clock source. */
    BKP_RTC_CLK_SRC_LSE     = BKP_RTC_CR_RTC_SEL_LSE,     /*!< The LSE oscillator clock is selected as the RTC clock source. */
    BKP_RTC_CLK_SRC_HSI_RTC = BKP_RTC_CR_RTC_SEL_HSI_RTC, /*!< The HSI_RTC clock is selected as the RTC clock source. */
    BKP_RTC_CLK_SRC_HSE_RTC = BKP_RTC_CR_RTC_SEL_HSE_RTC  /*!< The HSE_RTC clock is selected as the RTC clock source. */
} BKP_RTC_ClockSource_TypeDef;

#define IS_BKP_RTC_CLOCK_SOURCE(CLK) (((CLK) == BKP_RTC_CLK_SRC_LSI) ||     \
                                      ((CLK) == BKP_RTC_CLK_SRC_LSE) ||     \
                                      ((CLK) == BKP_RTC_CLK_SRC_HSI_RTC) || \
                                      ((CLK) == BKP_RTC_CLK_SRC_HSE_RTC))

/**
 * @brief BKP RTC time format.
 */
typedef enum {
    BKP_RTC_FMT_24H = ((uint32_t)0x0), /*!< Specify the RTC 24 hour/day format. */
    BKP_RTC_FMT_12H = ((uint32_t)0x1)  /*!< Specify the RTC 12 hour (AM/PM) format. */
} BKP_RTC_FMT_TypeDef;

#define IS_BKP_RTC_TIME_FORMAT(FMT) (((FMT) == BKP_RTC_FMT_24H) || \
                                     ((FMT) == BKP_RTC_FMT_12H))

/**
 * @brief BKP RTC day of week.
 */
typedef enum {
    BKP_RTC_WEEKDAY_MONDAY    = ((uint32_t)0x1), /*!< Specify the RTC MONDAY. */
    BKP_RTC_WEEKDAY_TUESDAY   = ((uint32_t)0x2), /*!< Specify the RTC TUESDAY. */
    BKP_RTC_WEEKDAY_WEDNESDAY = ((uint32_t)0x3), /*!< Specify the RTC WEDNESDAY. */
    BKP_RTC_WEEKDAY_THURSDAY  = ((uint32_t)0x4), /*!< Specify the RTC THURSDAY. */
    BKP_RTC_WEEKDAY_FRIDAY    = ((uint32_t)0x5), /*!< Specify the RTC FRIDAY. */
    BKP_RTC_WEEKDAY_SATURDAY  = ((uint32_t)0x6), /*!< Specify the RTC SATURDAY. */
    BKP_RTC_WEEKDAY_SUNDAY    = ((uint32_t)0x7)  /*!< Specify the RTC SUNDAY. */
} BKP_RTC_WeekDays_TypeDef;

#define IS_BKP_RTC_WEEKDAY(WDU) ((((WDU) & ~(uint32_t)0x7) == 0) && \
                                 ((WDU) != 0))

/**
 * @brief BKP RTC alarm.
 */
typedef enum {
    BKP_RTC_ALARM_A = ((uint32_t)0x1), /*!< Specify the RTC alarm A. */
    BKP_RTC_ALARM_B = ((uint32_t)0x2)  /*!< Specify the RTC alarm B. */
} BKP_RTC_Alarm_TypeDef;

#define IS_BKP_RTC_ALARM(ALARM) (((ALARM) == BKP_RTC_ALARM_A) || \
                                 ((ALARM) == BKP_RTC_ALARM_B))

/**
 * @brief BKP RTC TAMPER.
 */
typedef enum {
#if defined(USE_MDR32F02_REV_1X)
    BKP_RTC_TAMPER_ALL = BKP_RTC_TAFCR_TAMP_EN /*!< Specify the all TAMPERs (WAKEUP3-WAKEUP1 inputs). */
#else
    BKP_RTC_TAMPER_1   = BKP_RTC_TAFCR_TAMP_EN_W1, /*!< Specify the TAMPER 1 (WAKEUP1 input). */
    BKP_RTC_TAMPER_2   = BKP_RTC_TAFCR_TAMP_EN_W2, /*!< Specify the TAMPER 2 (WAKEUP2 input). */
    BKP_RTC_TAMPER_3   = BKP_RTC_TAFCR_TAMP_EN_W3, /*!< Specify the TAMPER 3 (WAKEUP3 input). */
    BKP_RTC_TAMPER_ALL = BKP_RTC_TAFCR_TAMP_EN_W1 |
                         BKP_RTC_TAFCR_TAMP_EN_W2 |
                         BKP_RTC_TAFCR_TAMP_EN_W3 /*!< Specify the all TAMPERs (WAKEUP3-WAKEUP1 inputs). */
#endif
} BKP_RTC_TAMPER_TypeDef;

#if defined(USE_MDR32F02_REV_1X)
#define IS_BKP_RTC_TAMPER(TAMPS)  ((TAMPS) == BKP_RTC_TAMPER_ALL)

#define IS_BKP_RTC_TAMPERS(TAMPS) ((TAMPS) == BKP_RTC_TAMPER_ALL)
#else
#define IS_BKP_RTC_TAMPER(TAMPS) (((TAMPS) == BKP_RTC_TAMPER_1) || \
                                  ((TAMPS) == BKP_RTC_TAMPER_2) || \
                                  ((TAMPS) == BKP_RTC_TAMPER_3) || \
                                  ((TAMPS) == BKP_RTC_TAMPER_ALL))

#define IS_BKP_RTC_TAMPERS(TAMPS) (((TAMPS) & ~(uint32_t)(BKP_RTC_TAMPER_1 | \
                                                          BKP_RTC_TAMPER_2 | \
                                                          BKP_RTC_TAMPER_3 | \
                                                          BKP_RTC_TAMPER_ALL)) == 0)
#endif

/**
 * @brief BKP RTC TAMPER WAKEUPx inputs.
 */
typedef enum {
    BKP_RTC_TAMPER_W1 = ((uint32_t)0x1), /*!< Specify the TAMPER to capture event on WAKEUP1 input. */
    BKP_RTC_TAMPER_W2 = ((uint32_t)0x2), /*!< Specify the TAMPER to capture event on WAKEUP2 input. */
    BKP_RTC_TAMPER_W3 = ((uint32_t)0x4), /*!< Specify the TAMPER to capture event on WAKEUP3 input. */
} BKP_RTC_TAMPER_Wakeup_TypeDef;

#define IS_BKP_RTC_TAMPER_WAKEUPS(TAMP_WS) (((TAMP_WS) & ~(uint32_t)(BKP_RTC_TAMPER_W1 | \
                                                                     BKP_RTC_TAMPER_W2 | \
                                                                     BKP_RTC_TAMPER_W3)) == 0)

/**
 * @brief BKP RTC TAMPER WAKEUPx event.
 */
typedef enum {
    BKP_RTC_TAMPER_EVNT_EDGE_RISING_LEVEL_HIGH = (((uint32_t)0x0) << BKP_RTC_TAFCR_TAMP_TRG_Pos), /*!< Select the rising edge or high level to capture the TAMPER event. */
    BKP_RTC_TAMPER_EVNT_EDGE_FALLING_LEVEL_LOW = (((uint32_t)0x1) << BKP_RTC_TAFCR_TAMP_TRG_Pos), /*!< Select the falling edge or low level to capture the TAMPER event. */
#if defined(USE_MDR32F02_REV_2) || defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
    BKP_RTC_TAMPER_EVNT_LEVEL_HIGH   = (((uint32_t)0x0) << BKP_RTC_TAFCR_TAMP_TRG_Pos) | (((uint32_t)0x1) << BKP_RTC_TAFCR_TAMP_EDGE_W_Pos),  /*!< Select the high level to capture the TAMPER event. */
    BKP_RTC_TAMPER_EVNT_LEVEL_LOW    = (((uint32_t)0x1) << BKP_RTC_TAFCR_TAMP_TRG_Pos) | (((uint32_t)0x1) << BKP_RTC_TAFCR_TAMP_EDGE_W_Pos),  /*!< Select the low level to capture the TAMPER event. */
    BKP_RTC_TAMPER_EVNT_EDGE_RISING  = (((uint32_t)0x0) << BKP_RTC_TAFCR_TAMP_TRG_Pos) | (((uint32_t)0x1) << BKP_RTC_TAFCR_TAMP_LEVEL_W_Pos), /*!< Select the rising edge to capture the TAMPER event. */
    BKP_RTC_TAMPER_EVNT_EDGE_FALLING = (((uint32_t)0x1) << BKP_RTC_TAFCR_TAMP_TRG_Pos) | (((uint32_t)0x1) << BKP_RTC_TAFCR_TAMP_LEVEL_W_Pos)  /*!< Select the falling edge to capture the TAMPER event. */
#endif
} BKP_RTC_TAMPER_Event_TypeDef;

