piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/inc/MDR32VF0xI_bkp.h
#if defined(USE_MDR32F02_REV_1X)
#define IS_BKP_RTC_TAMPER_EVENT(EVNT) (((EVNT) == BKP_RTC_TAMPER_EVNT_EDGE_RISING_LEVEL_HIGH) || \
                                       ((EVNT) == BKP_RTC_TAMPER_EVNT_EDGE_FALLING_LEVEL_LOW))
#else
#define IS_BKP_RTC_TAMPER_EVENT(EVNT) (((EVNT) == BKP_RTC_TAMPER_EVNT_EDGE_RISING_LEVEL_HIGH) || \
                                       ((EVNT) == BKP_RTC_TAMPER_EVNT_EDGE_FALLING_LEVEL_LOW) || \
                                       ((EVNT) == BKP_RTC_TAMPER_EVNT_LEVEL_HIGH) ||             \
                                       ((EVNT) == BKP_RTC_TAMPER_EVNT_LEVEL_LOW) ||              \
                                       ((EVNT) == BKP_RTC_TAMPER_EVNT_EDGE_RISING) ||            \
                                       ((EVNT) == BKP_RTC_TAMPER_EVNT_EDGE_FALLING))
#endif

/**
 * @brief BKP RTC TIMESTAMP WAKEUPx inputs.
 */
typedef enum {
    BKP_RTC_TIMESTAMP_W1 = ((uint32_t)0x1), /*!< Specify the TIMESTAMP to capture event on WAKEUP1 input. */
    BKP_RTC_TIMESTAMP_W2 = ((uint32_t)0x2), /*!< Specify the TIMESTAMP to capture event on WAKEUP2 input. */
    BKP_RTC_TIMESTAMP_W3 = ((uint32_t)0x4)  /*!< Specify the TIMESTAMP to capture event on WAKEUP3 input. */
} BKP_RTC_TIMESTAMP_Wakeup_TypeDef;

#define IS_BKP_RTC_TIMESTAMP_WAKEUP(TS_W) (((TS_W) == BKP_RTC_TIMESTAMP_W1) || \
                                           ((TS_W) == BKP_RTC_TIMESTAMP_W2) || \
                                           ((TS_W) == BKP_RTC_TIMESTAMP_W3))

#define IS_BKP_RTC_TIMESTAMP_WAKEUPS(TS_WS) (((TS_WS) & ~(uint32_t)(BKP_RTC_TIMESTAMP_W1 | \
                                                                    BKP_RTC_TIMESTAMP_W2 | \
                                                                    BKP_RTC_TIMESTAMP_W3)) == 0)

/**
 * @brief BKP RTC TIMESTAMP WAKEUPx event.
 */
typedef enum {
    BKP_RTC_TIMESTAMP_EVNT_EDGE_RISING  = (((uint32_t)0x0) << BKP_RTC_TAFCR_TS_EDGE_Pos), /*!< Select the rising edge to capture the TIMESTAMP event. */
    BKP_RTC_TIMESTAMP_EVNT_EDGE_FALLING = (((uint32_t)0x1) << BKP_RTC_TAFCR_TS_EDGE_Pos)  /*!< Select the falling edge to capture the TIMESTAMP event. */
} BKP_RTC_TIMESTAMP_Event_TypeDef;

#define IS_BKP_RTC_TIMESTAMP_EVENT(EVNT) (((EVNT) == BKP_RTC_TIMESTAMP_EVNT_EDGE_RISING) || \
                                          ((EVNT) == BKP_RTC_TIMESTAMP_EVNT_EDGE_FALLING))

/**
 * @brief BKP RTC interrupt definition.
 */
typedef enum {
    BKP_RTC_IT_SECF      = BKP_RTC_CS_SECF_IE,          /*!< RTC second event interrupt. */
    BKP_RTC_IT_ALARM_A   = BKP_RTC_CS_ALRAF_IE,         /*!< RTC alarm A event interrupt. */
    BKP_RTC_IT_ALARM_B   = BKP_RTC_CS_ALRBF_IE,         /*!< RTC alarm B event interrupt. */
    BKP_RTC_IT_WUTF      = BKP_RTC_CS_WUTF_IE,          /*!< WUT alarm event interrupt. */
    BKP_RTC_IT_OWF       = BKP_RTC_CS_OWF_IE,           /*!< WUT overflow event interrupt. */
    BKP_RTC_IT_TAMPER    = BKP_RTC_TAFCR_TAMP_IE << 16, /*!< TAMPER event interrupt. */
    BKP_RTC_IT_TIMESTAMP = BKP_RTC_TAFCR_TS_IE << 16    /*!< TIMESTAMP event interrupt. */
} BKP_RTC_IT_TypeDef;

#define IS_BKP_RTC_CONFIG_IT(IT) (((IT) == BKP_RTC_IT_SECF) ||    \
                                  ((IT) == BKP_RTC_IT_ALARM_A) || \
                                  ((IT) == BKP_RTC_IT_ALARM_B) || \
                                  ((IT) == BKP_RTC_IT_WUTF) ||    \
                                  ((IT) == BKP_RTC_IT_OWF) ||     \
                                  ((IT) == BKP_RTC_IT_TAMPER) ||  \
                                  ((IT) == BKP_RTC_IT_TIMESTAMP))

#define IS_BKP_RTC_CONFIG_ITS(ITS) (((ITS) & ~(uint32_t)(BKP_RTC_IT_SECF |    \
                                                         BKP_RTC_IT_ALARM_A | \
                                                         BKP_RTC_IT_ALARM_B | \
                                                         BKP_RTC_IT_WUTF |    \
                                                         BKP_RTC_IT_OWF |     \
                                                         BKP_RTC_IT_TAMPER |  \
                                                         BKP_RTC_IT_TIMESTAMP)) == 0)

/**
 * @brief BKP RTC flags.
 */
typedef enum {
    BKP_RTC_FLAG_SECF         = BKP_RTC_CS_SECF,            /*!< RTC second event flag. */
    BKP_RTC_FLAG_ALARM_A      = BKP_RTC_CS_ALRAF,           /*!< RTC alarm A event flag. */
    BKP_RTC_FLAG_ALARM_B      = BKP_RTC_CS_ALRBF,           /*!< RTC alarm B event flag. */
    BKP_RTC_FLAG_WUTF         = BKP_RTC_CS_WUTF,            /*!< WUT alarm event flag. */
    BKP_RTC_FLAG_OWF          = BKP_RTC_CS_OWF,             /*!< WUT overflow event flag. */
    BKP_RTC_FLAG_WEC          = BKP_RTC_CS_WEC,             /*!< RTC and WUT write operation flag. */
    BKP_RTC_FLAG_TAMPER       = BKP_LDO_TAMPF,              /*!< TAMPER event flag (WAKEUP3-WAKEUP1). */
    BKP_RTC_FLAG_TAMPER_W1    = BKP_RTC_TAFCR_TAMP_IN_SEL1, /*!< TAMPER WAKEUP1 event flag. */
    BKP_RTC_FLAG_TAMPER_W2    = BKP_RTC_TAFCR_TAMP_IN_SEL2, /*!< TAMPER WAKEUP2 event flag. */
    BKP_RTC_FLAG_TAMPER_W3    = BKP_RTC_TAFCR_TAMP_IN_SEL3, /*!< TAMPER WAKEUP3 event flag. */
    BKP_RTC_FLAG_TIMESTAMP    = BKP_RTC_CS_TSF,             /*!< TIMESTAMP event flag (WAKEUP3-WAKEUP1). */
    BKP_RTC_FLAG_TIMESTAMP_W1 = BKP_RTC_TAFCR_TS_IN_SEL1,   /*!< TIMESTAMP WAKEUP1 event flag. */
    BKP_RTC_FLAG_TIMESTAMP_W2 = BKP_RTC_TAFCR_TS_IN_SEL2,   /*!< TIMESTAMP WAKEUP2 event flag. */
    BKP_RTC_FLAG_TIMESTAMP_W3 = BKP_RTC_TAFCR_TS_IN_SEL3,   /*!< TIMESTAMP WAKEUP3 event flag. */
#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
    BKP_RTC_FLAG_TMPCAL_RESULTRDY = BKP_RTC_TMPCAL3_TEMP_RESULT_RDY /*!< TMPCAL result ready flag. */
#endif
} BKP_RTC_Flags_TypeDef;

#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
#define IS_BKP_RTC_FLAG(FLAG) (((FLAG) == BKP_RTC_FLAG_SECF) ||         \
                               ((FLAG) == BKP_RTC_FLAG_ALARM_A) ||      \
                               ((FLAG) == BKP_RTC_FLAG_ALARM_B) ||      \
                               ((FLAG) == BKP_RTC_FLAG_WUTF) ||         \
                               ((FLAG) == BKP_RTC_FLAG_OWF) ||          \
                               ((FLAG) == BKP_RTC_FLAG_WEC) ||          \
                               ((FLAG) == BKP_RTC_FLAG_TAMPER) ||       \
                               ((FLAG) == BKP_RTC_FLAG_TAMPER_W1) ||    \
                               ((FLAG) == BKP_RTC_FLAG_TAMPER_W2) ||    \
                               ((FLAG) == BKP_RTC_FLAG_TAMPER_W3) ||    \
                               ((FLAG) == BKP_RTC_FLAG_TIMESTAMP) ||    \
                               ((FLAG) == BKP_RTC_FLAG_TIMESTAMP_W1) || \
                               ((FLAG) == BKP_RTC_FLAG_TIMESTAMP_W2) || \
                               ((FLAG) == BKP_RTC_FLAG_TIMESTAMP_W3) || \
                               ((FLAG) == BKP_RTC_FLAG_TMPCAL_RESULTRDY))
#else
#define IS_BKP_RTC_FLAG(FLAG) (((FLAG) == BKP_RTC_FLAG_SECF) ||         \
                               ((FLAG) == BKP_RTC_FLAG_ALARM_A) ||      \
                               ((FLAG) == BKP_RTC_FLAG_ALARM_B) ||      \
                               ((FLAG) == BKP_RTC_FLAG_WUTF) ||         \
                               ((FLAG) == BKP_RTC_FLAG_OWF) ||          \
                               ((FLAG) == BKP_RTC_FLAG_WEC) ||          \
                               ((FLAG) == BKP_RTC_FLAG_TAMPER) ||       \
                               ((FLAG) == BKP_RTC_FLAG_TAMPER_W1) ||    \
                               ((FLAG) == BKP_RTC_FLAG_TAMPER_W2) ||    \
                               ((FLAG) == BKP_RTC_FLAG_TAMPER_W3) ||    \
                               ((FLAG) == BKP_RTC_FLAG_TIMESTAMP) ||    \
                               ((FLAG) == BKP_RTC_FLAG_TIMESTAMP_W1) || \
                               ((FLAG) == BKP_RTC_FLAG_TIMESTAMP_W2) || \
                               ((FLAG) == BKP_RTC_FLAG_TIMESTAMP_W3))
#endif

