piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/inc/MDR32VF0xI_bkp.h
#if defined(USE_MDR32F02_REV_1X)
#define IS_BKP_RTC_FLAG_CLR(FLAG) (((FLAG) == BKP_RTC_FLAG_SECF) ||    \
                                   ((FLAG) == BKP_RTC_FLAG_ALARM_A) || \
                                   ((FLAG) == BKP_RTC_FLAG_ALARM_B) || \
                                   ((FLAG) == BKP_RTC_FLAG_WUTF) ||    \
                                   ((FLAG) == BKP_RTC_FLAG_OWF) ||     \
                                   ((FLAG) == BKP_RTC_FLAG_TAMPER) ||  \
                                   ((FLAG) == BKP_RTC_FLAG_TIMESTAMP))

#define IS_BKP_RTC_FLAGS_CLR(FLAGS) (((FLAGS) & ~(uint32_t)(BKP_RTC_FLAG_SECF |    \
                                                            BKP_RTC_FLAG_ALARM_A | \
                                                            BKP_RTC_FLAG_ALARM_B | \
                                                            BKP_RTC_FLAG_WUTF |    \
                                                            BKP_RTC_FLAG_OWF |     \
                                                            BKP_RTC_FLAG_TAMPER |  \
                                                            BKP_RTC_FLAG_TIMESTAMP)) == 0)
#else
#define IS_BKP_RTC_FLAG_CLR(FLAG) (((FLAG) == BKP_RTC_FLAG_SECF) ||         \
                                   ((FLAG) == BKP_RTC_FLAG_ALARM_A) ||      \
                                   ((FLAG) == BKP_RTC_FLAG_ALARM_B) ||      \
                                   ((FLAG) == BKP_RTC_FLAG_WUTF) ||         \
                                   ((FLAG) == BKP_RTC_FLAG_OWF) ||          \
                                   ((FLAG) == BKP_RTC_FLAG_TAMPER) ||       \
                                   ((FLAG) == BKP_RTC_FLAG_TAMPER_W1) ||    \
                                   ((FLAG) == BKP_RTC_FLAG_TAMPER_W2) ||    \
                                   ((FLAG) == BKP_RTC_FLAG_TAMPER_W3) ||    \
                                   ((FLAG) == BKP_RTC_FLAG_TIMESTAMP) ||    \
                                   ((FLAG) == BKP_RTC_FLAG_TIMESTAMP_W1) || \
                                   ((FLAG) == BKP_RTC_FLAG_TIMESTAMP_W2) || \
                                   ((FLAG) == BKP_RTC_FLAG_TIMESTAMP_W3))

#define IS_BKP_RTC_FLAGS_CLR(FLAGS) (((FLAGS) & ~(uint32_t)(BKP_RTC_FLAG_SECF |         \
                                                            BKP_RTC_FLAG_ALARM_A |      \
                                                            BKP_RTC_FLAG_ALARM_B |      \
                                                            BKP_RTC_FLAG_WUTF |         \
                                                            BKP_RTC_FLAG_OWF |          \
                                                            BKP_RTC_FLAG_TAMPER |       \
                                                            BKP_RTC_FLAG_TAMPER_W1 |    \
                                                            BKP_RTC_FLAG_TAMPER_W2 |    \
                                                            BKP_RTC_FLAG_TAMPER_W3 |    \
                                                            BKP_RTC_FLAG_TIMESTAMP |    \
                                                            BKP_RTC_FLAG_TIMESTAMP_W1 | \
                                                            BKP_RTC_FLAG_TIMESTAMP_W2 | \
                                                            BKP_RTC_FLAG_TIMESTAMP_W3)) == 0)
#endif

/**
 * @brief BKP RTC date and time structure.
 *        Data can be stored in BIN or BCD format, use BKP_ConvertToXX() functions to convert one format to the other.
 */
typedef struct {
    uint8_t                  RTC_Year;    /*!< Year (0-99) in binary or BCD format. */
    uint8_t                  RTC_Month;   /*!< Months (1-12) in binary or BCD format. */
    uint8_t                  RTC_Day;     /*!< Days (1-31) in binary or BCD format. */
    BKP_RTC_WeekDays_TypeDef RTC_WeekDay; /*!< A day of the week.
                                               This parameter is a value of the @ref BKP_RTC_WeekDays_TypeDef. */
    BKP_RTC_FMT_TypeDef RTC_TimeFormat;   /*!< Select 24h or 12h time format.
                                               This parameter is a value of the @ref BKP_RTC_FMT_TypeDef. */
    uint8_t RTC_Hours;                    /*!< Hours in binary or BCD format. */
    uint8_t RTC_Minutes;                  /*!< Minutes in binary or BCD format. */
    uint8_t RTC_Seconds;                  /*!< Seconds in binary or BCD format. */
} BKP_RTC_DateTime_TypeDef;

/**
 * @brief BKP RTC alarm structure.
 */
typedef struct {
    FunctionalState RTC_IgnoreDate;            /*!< The date is ignored.
                                                    This parameter is a value of the @ref FunctionalState. */
    FunctionalState RTC_UseWeekDayInsteadDays; /*!< A weekday is used instead of days (days must be ignored).
                                                    This parameter is a value of the @ref FunctionalState. */
    BKP_RTC_WeekDays_TypeDef RTC_WeekDay;      /*!< A day of the week.
                                                    This parameter is a value of the @ref BKP_RTC_WeekDays_TypeDef.
                                                    If @ref RTC_UseWeekDayInsteadDays == ENABLE, this field is used, the @ref RTC_Day is ignored. */
    uint8_t RTC_Day;                           /*!< Days (1-31) in binary or BCD format.
                                                    If @ref RTC_UseWeekDayInsteadDays == DISABLE, this field is used, the @ref RTC_WeekDay is ignored. */
    uint8_t         RTC_Hours;                 /*!< Hours in binary or BCD format. */
    uint8_t         RTC_Minutes;               /*!< Minutes in binary or BCD format. */
    uint8_t         RTC_Seconds;               /*!< Seconds in binary or BCD format. */
    FunctionalState RTC_IgnoreHours;           /*!< Hours are ignored.
                                                    This parameter is a value of the @ref FunctionalState. */
    BKP_RTC_FMT_TypeDef RTC_TimeFormat;        /*!< Select 24h or 12h time format.
                                                    This parameter is a value of the @ref BKP_RTC_FMT_TypeDef. */
    FunctionalState RTC_IgnoreMinutes;         /*!< Minutes are ignored.
                                                    This parameter is a value of the @ref FunctionalState. */
    FunctionalState RTC_IgnoreSeconds;         /*!< Seconds are ignored.
                                                    This parameter is a value of the @ref FunctionalState. */
} BKP_RTC_AlarmDateTime_TypeDef;

