piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/inc/MDR32VF0xI_bkp.h
#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
/**
 * @brief BKP RTC LSE calibration constants for temperature compensation structure.
 */
typedef struct {
    uint8_t Const[16];
} BKP_RTC_TMPCAL_Calibration_TypeDef;

#define IS_BKP_RTC_TMPCAL_CALIBRATION(CAL) (((CAL) & ~(BKP_RTC_TMPCAL1_CONST0_Msk >> BKP_RTC_TMPCAL1_CONST0_Pos)) == 0)
#endif

/** @} */ /* End of the group BKP_Exported_Types */

/** @defgroup BKP_Exported_Defines BKP Exported Defines
 * @{
 */

/**
 * @brief Convert BCD format to BIN format.
 */
#define CONVERT_BCD_TO_BIN(BCD) (uint8_t)(((((uint8_t)(BCD) & 0xF0) >> 4) * 10) + ((uint8_t)(BCD) & 0x0F))

/**
 * @brief Convert BIN format to BCD format.
 */
#define CONVERT_BIN_TO_BCD(BIN) (uint8_t)(((((uint8_t)(BIN) / 10) % 10) << 4) + ((uint8_t)(BIN) % 10))

/**
 * @brief BKP LDO boost.
 */
#define IS_BKP_LDO_BOOST(BOOST) (((BOOST) & ~(BKP_LDO_LDO_BOOST_Msk >> BKP_LDO_LDO_BOOST_Pos)) == 0)

/**
 * @brief BKP MCU mode.
 */
#define IS_BKP_MODE(MODE) (((MODE) & ~(BKP_LDO_MODE_Msk >> BKP_LDO_MODE_Pos)) == 0)

/**
 * @brief BKP LSE configuration.
 */
#define IS_BKP_LSE_CONF(CONF) (((CONF) & ~(BKP_CLK_LSE_CONF_Msk >> BKP_CLK_LSE_CONF_Pos)) == 0)

/**
 * @brief BKP HSI and LSI trimming.
 */
#define IS_BKP_HSI_LSI_TRIM_VALUE(TRIM) (((TRIM) & ~(BKP_CLK_HSI_LSI_TRIM_Msk >> BKP_CLK_HSI_LSI_TRIM_Pos)) == 0)

/**
 * @brief BKP RTC prescaler counter value.
 */
#define IS_BKP_RTC_PRESCALER_COUNTER_VALUE(VAL) (((VAL) & ~BKP_RTC_PREDIV_S_RTC_DIV_Msk) == 0)

/**
 * @brief BKP RTC prescaler value.
 */
#define IS_BKP_RTC_PRESCALER_VALUE(VAL) (((VAL) & ~BKP_RTC_PRL_RTC_PRL_Msk) == 0)

/**
 * @brief BKP RTC BCD years.
 */
#define IS_BKP_RTC_BCD_YEARS(YEAR) ((((YEAR) & (uint8_t)0xF) <= 9) && (((YEAR) & (uint8_t)0xF0) <= 0x90))

/**
 * @brief BKP RTC BIN years.
 */
#define IS_BKP_RTC_BIN_YEARS(YEAR) (((YEAR) >= 2000) && ((YEAR) <= 2099))

/**
 * @brief BKP RTC BCD month.
 */
#define IS_BKP_RTC_BCD_MONTH(MONTH) ((((MONTH) & (uint8_t)0xF) <= 9) && \
                                     (((MONTH) >= 0x01) && ((MONTH) <= 0x12)))

/**
 * @brief BKP RTC BIN month.
 */
#define IS_BKP_RTC_BIN_MONTH(MONTH) (((MONTH) >= 1) && ((MONTH) <= 12))

/**
 * @brief BKP RTC BCD days.
 */
#define IS_BKP_RTC_BCD_DAY(DAY) ((((DAY) & (uint8_t)0xF) <= 9) && \
                                 (((DAY) >= 0x01) && ((DAY) <= 0x31)))

/**
 * @brief BKP RTC BIN days.
 */
#define IS_BKP_RTC_BIN_DAY(DAY) (((DAY) >= 1) && ((DAY) <= 31))

/**
 * @brief BKP RTC BCD hours.
 */
#define IS_BKP_RTC_BCD_HOUR(HR) ((((HR) & (uint8_t)0xF) <= 9) && ((HR) <= 0x23))

/**
 * @brief BKP RTC BIN hours.
 */
#define IS_BKP_RTC_BIN_HOUR(HR) (((HR) <= 23))

/**
 * @brief BKP RTC BCD PM flag.
 */
#define IS_BKP_RTC_BCD_PM_HOUR(HR) ((((HR) & (uint8_t)0xF) <= 9) && \
                                    (((HR) >= 0x01) && ((HR) <= 0x12)))

/**
 * @brief BKP RTC BIN PM flag.
 */
#define IS_BKP_RTC_BIN_PM_HOUR(HR) (((HR) >= 1) && ((HR) <= 12))

/**
 * @brief BKP RTC BCD minutes or seconds.
 */
#define IS_BKP_RTC_BCD_MIN_SECS(MS) ((((MS) & (uint8_t)0xF) <= 9) && ((MS) <= 0x59))

/**
 * @brief BKP RTC BIN minutes or seconds.
 */
#define IS_BKP_RTC_BIN_MIN_SECS(MS) ((MS) <= 59)

/** @} */ /* End of the group BKP_Exported_Defines */

/** @addtogroup BKP_Exported_Functions BKP Exported Functions
 * @{
 */

/** @addtogroup BKP_Common_Control_Functions BKP Common Control Functions
 * @{
 */

void       BKP_SetRegistersLock(FlagStatus LockState);
FlagStatus BKP_GetRegistersLock(void);

void BKP_DeInit(uint32_t Subblocks);

/** @} */ /* End of the group BKP_Common_Control_Functions */

/** @addtogroup BKP_Control_Functions BKP Control Functions
 * @{
 */

void            BKP_JTAG_Cmd(FunctionalState NewState);
FunctionalState BKP_JTAG_GetCmdState(void);

FlagStatus BKP_GetWAKEUPStatus(BKP_WAKEUP_TypeDef Wakeup);

void    BKP_LDO_SetBoostTrim(uint8_t LDO_Boost);
uint8_t BKP_LDO_GetBoostTrim(void);

void                   BKP_BLDO_SetBoostTrim(BKP_BLDO_Boost_TypeDef BLDO_Boost);
BKP_BLDO_Boost_TypeDef BKP_BLDO_GetBoostTrim(void);

/** @} */ /* End of the group BKP_Control_Functions */

/** @addtogroup BKP_Software_Functions BKP Software Functions
 * @{
 */

void       BKP_SetFlagPOR(FlagStatus PORFlag);
FlagStatus BKP_GetFlagPOR(void);

void    BKP_SetMODE(uint8_t Mode);
uint8_t BKP_GetMODE(void);

/** @} */ /* End of the group BKP_Software_Functions */

/** @addtogroup BKP_Emergency_Power_Supply_Control_Functions BKP Emergency Power Supply Control Functions
 * @{
 */

void            BKP_SW_Cmd(FunctionalState NewState);
FunctionalState BKP_SW_GetCmdState(void);

void       BKP_SW_DisablePower(void);
FlagStatus BKP_SW_GetPowerStatus(void);

#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
void                    BKP_SW_SetPolarity(BKP_SW_Polarity_TypeDef Polarity);
BKP_SW_Polarity_TypeDef BKP_SW_GetPolarity(void);
#endif

/** @} */ /* End of the group BKP_Emergency_Power_Supply_Control_Functions */

/** @addtogroup BKP_Clock_Source_Control_Functions BKP Clock Source Control Functions
 * @{
 */

void            BKP_HSI_Cmd(FunctionalState NewState);
FunctionalState BKP_HSI_GetCmdState(void);
void            BKP_HSI_LSI_SetTrim(uint8_t TrimValue);
uint8_t         BKP_HSI_LSI_GetTrim(void);
ErrorStatus     BKP_HSI_GetStatus(void);

void            BKP_LSI_Cmd(FunctionalState NewState);
FunctionalState BKP_LSI_GetCmdState(void);
ErrorStatus     BKP_LSI_GetStatus(void);

void                 BKP_LSE_Cmd(FunctionalState NewState);
void                 BKP_LSE_Config(BKP_LSE_Mode_TypeDef LSEMode);
BKP_LSE_Mode_TypeDef BKP_LSE_GetModeConfig(void);
ErrorStatus          BKP_LSE_GetStatus(void);
void                 BKP_LSE_SetWorkConfig(uint8_t LSEConf);

FlagStatus BKP_CLK_GetFlagStatus(BKP_CLK_Flags_TypeDef Flag);

/** @} */ /* End of the group BKP_Clock_Source_Control_Functions */

/** @addtogroup BKP_RTC_Control_Functions BKP RTC Control Functions
 * @{
 */

void            BKP_RTC_Reset(FunctionalState NewState);
void            BKP_RTC_Cmd(FunctionalState NewState);
FunctionalState BKP_RTC_GetCmdState(void);

