piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/inc/MDR32VF0xI_bkp.h
void BKP_RTC_WaitForUpdate(void);

void                        BKP_RTC_SetClkSource(BKP_RTC_ClockSource_TypeDef ClockSource);
BKP_RTC_ClockSource_TypeDef BKP_RTC_GetClkSource(void);
void                        BKP_RTC_WaitClkSwitch(BKP_RTC_ClockSource_TypeDef ClockSource);

void    BKP_RTC_SetClkCalibration(uint8_t Calibration);
uint8_t BKP_RTC_GetClkCalibration(void);

void     BKP_RTC_SetPrescalerCounter(uint32_t PrescalerCounterValue);
uint32_t BKP_RTC_GetPrescalerCounter(void);

void     BKP_RTC_SetPrescaler(uint32_t PrescalerValue);
uint32_t BKP_RTC_GetPrescaler(void);

void BKP_RTC_SetDateTimeBCD(const BKP_RTC_DateTime_TypeDef* RTC_DateTime, BitStatus SetDate, BitStatus SetTime);
void BKP_RTC_GetDateTimeBCD(BKP_RTC_DateTime_TypeDef* RTC_DateTime);

void BKP_RTC_SetAlarmBCD(BKP_RTC_Alarm_TypeDef RTC_Alarm, const BKP_RTC_AlarmDateTime_TypeDef* RTC_AlarmDateTime);
void BKP_RTC_GetAlarmBCD(BKP_RTC_Alarm_TypeDef RTC_Alarm, BKP_RTC_AlarmDateTime_TypeDef* RTC_AlarmDateTime);

/** @addtogroup BKP_RTC_WUT_Control_Functions BKP RTC WUT Control Functions
 * @{
 */

void                            BKP_RTC_WUT_SetClkSource(BKP_RTC_WUT_ClockSource_TypeDef ClockSource);
BKP_RTC_WUT_ClockSource_TypeDef BKP_RTC_WUT_GetClkSource(void);

void     BKP_RTC_WUT_SetCounter(uint32_t CounterValue);
uint32_t BKP_RTC_WUT_GetCounter(void);

void     BKP_RTC_WUT_SetAlarm(uint32_t AlarmValue);
uint32_t BKP_RTC_WUT_GetAlarm(void);

#if defined(USE_MDR32F02_REV_2) || defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
void                          BKP_RTC_WUT_SetSWControl(BKP_RTC_WUT_SWControl_TypeDef SWControl);
BKP_RTC_WUT_SWControl_TypeDef BKP_RTC_WUT_GetSWControl(void);
#endif

/** @} */ /* End of the group BKP_RTC_WUT_Control_Functions */

/** @addtogroup BKP_RTC_Event_Detection_Control_Functions BKP RTC Event Detection Control Functions
 * @{
 */

void            BKP_RTC_TAMPER_Cmd(uint32_t Tampers, FunctionalState NewState);
FunctionalState BKP_RTC_TAMPER_GetCmdState(BKP_RTC_TAMPER_TypeDef Tampers);
void            BKP_RTC_TAMPER_SetEvent(uint32_t Wakeups, BKP_RTC_TAMPER_Event_TypeDef Event);

void            BKP_RTC_TIMESTAMP_Cmd(FunctionalState NewState);
FunctionalState BKP_RTC_TIMESTAMP_GetCmdState(void);
void            BKP_RTC_TIMESTAMP_SetEvent(uint32_t Wakeups, BKP_RTC_TIMESTAMP_Event_TypeDef Event);
void            BKP_RTC_TIMESTAMP_GetDateTimeBCD(BKP_RTC_TIMESTAMP_Wakeup_TypeDef Wakeup, BKP_RTC_DateTime_TypeDef* RTC_DateTime);

/** @} */ /* End of the group BKP_RTC_Event_Detection_Control_Functions */

#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
/** @addtogroup BKP_RTC_TMPCAL_Control_Functions BKP RTC TMPCAL Control Functions
 * @{
 */

void            BKP_RTC_TMPCAL_Cmd(FunctionalState NewState);
FunctionalState BKP_RTC_TMPCAL_GetCmdState(void);

void BKP_RTC_TMPCAL_SetCalibration(const BKP_RTC_TMPCAL_Calibration_TypeDef* TMPCAL_Calibration);
void BKP_RTC_TMPCAL_GetCalibration(BKP_RTC_TMPCAL_Calibration_TypeDef* TMPCAL_Calibration);

uint8_t BKP_RTC_TMPCAL_GetResult(void);

/** @} */ /* End of the group BKP_RTC_TMPCAL_Control_Functions */
#endif

void BKP_RTC_ConvertToBINFormat(BKP_RTC_DateTime_TypeDef* RTC_DateTime);
void BKP_RTC_ConvertToBCDFormat(BKP_RTC_DateTime_TypeDef* RTC_DateTime);

void       BKP_RTC_ClearFlags(uint32_t Flags);
FlagStatus BKP_RTC_GetFlagStatus(BKP_RTC_Flags_TypeDef Flag);
uint32_t   BKP_RTC_GetStatus(void);

void BKP_RTC_ITConfig(uint32_t ITs, FunctionalState NewState);

/** @} */ /* End of the group BKP_RTC_Control_Functions */

/** @} */ /* End of the group BKP_Exported_Functions */

/** @} */ /* End of the group BKP */

/** @} */ /* End of the group MDR32VF0xI_StdPeriph_Driver */

#ifdef __cplusplus
} // extern "C" block end
#endif

#endif /* MDR32VF0xI_BKP_H */

/*********************** (C) COPYRIGHT 2025 Milandr ****************************
 *
 * END OF FILE MDR32VF0xI_bkp.h */

